# Задача 3 была реализована на Python.
vvod = input()
str_vvod = ''.join(vvod)
print(eval(str_vvod))